** Test
#+begin_src scheme :results table
  (load "5.13.register-machine.scm") ; Use simplified register machine API
  (load "5.register-machine.stack-monitor.scm")
  (load "5.15.register-machine.machine.scm")
  (define (mach-fact-run n)
    (let ((mach-fact
           (make-machine
            (list (list '* *)
                  (list '- -)
                  (list '= =))
            '((assign continue (label fact-done))       ; set up final return address
              fact-loop
                (test (op =) (reg n) (const 1))
                (branch (label base-case))
                ;; Set up for the recursive call by saving n and continue.
                ;; Set up continue so that the computation will continue
                ;; at after-fact when the subroutine returns.
                (save continue)
                (save n)
                (assign n (op -) (reg n) (const 1))
                (assign continue (label after-fact))
                (goto (label fact-loop))
              after-fact
                (restore n)
                (restore continue)
                (assign val (op *) (reg n) (reg val))   ; val now contains n(n - 1)!
                (goto (reg continue))                   ; return to caller
              base-case
                (assign val (const 1))                  ; base case: 1! = 1
                (goto (reg continue))                   ; return to caller
              fact-done))))
      (set-register-contents! mach-fact 'n n)
      (start mach-fact)
      (list n (mach-fact 'inst-count))))
  (cons (list 'n 'inst-count)
        (cons 'hline
              (map mach-fact-run
                   (enumerate-interval 1 20))))
#+end_src

#+RESULTS:
|  n | inst-count |
|----+------------|
|  1 |          5 |
|  2 |         16 |
|  3 |         27 |
|  4 |         38 |
|  5 |         49 |
|  6 |         60 |
|  7 |         71 |
|  8 |         82 |
|  9 |         93 |
| 10 |        104 |
| 11 |        115 |
| 12 |        126 |
| 13 |        137 |
| 14 |        148 |
| 15 |        159 |
| 16 |        170 |
| 17 |        181 |
| 18 |        192 |
| 19 |        203 |
| 20 |        214 |
